package main

import (
	"fmt"
	"time"
)

// Функция имитирует долгую работу
func boilKettle() {
	fmt.Println(" 🔥 Чайник: Начинаю кипятить воду...")
	time.Sleep(2 * time.Second) // Ждем 2 секунды
	fmt.Println(" 🔥 Чайник: Вскипел!")
}

func cutVegetables() {
	fmt.Println(" 🔪 Овощи: Начинаю резать...")
	time.Sleep(1 * time.Second)
	fmt.Println(" 🔪 Овощи: Нарезаны!")
}

func fryMeat() {
	fmt.Println(" 🔥 Начинаю жарить...")
	time.Sleep(4 * time.Second)
	fmt.Println(" 🔥 Пожарил!")
}

func main() {
	// --- ВАРИАНТ 1: ПОСЛЕДОВАТЕЛЬНО (Медленно) ---
	/*
		fmt.Println("=== ВАРИАНТ 1: Один человек ===")
		start := time.Now() // Засекаем время

		boilKettle()
		cutVegetables()

		fmt.Printf("Итого времени: %s\n", time.Since(start))
	*/

	// ---  ВАРИАНТ 2: ГОРУТИНЫ (Быстро) ---
	fmt.Println("\n=== ВАРИАНТ 2: Кухня с помощниками ===")
	start2 := time.Now()

	// Ключевое слово "go" запускает функцию в НОВОМ потоке.
	// Программа НЕ ЖДЕТ, пока она закончится, а сразу идет дальше!
	go boilKettle()
	go cutVegetables()
	go fryMeat()

	fmt.Println("Я (main) раздал задачи и свободен!")

	// ПРОБЛЕМА ГОРУТИН:
	// Функция main - это тоже горутина (главная).
	// Если main закончится, она УБЬЕТ всех своих помощников, даже если они не доделали работу.
	// Поэтому нам придется подождать их вручную (костыль на сегодня).

	time.Sleep(5 * time.Second) // Ждем с запасом, чтобы они успели

	fmt.Printf("Итого времени: %s\n", time.Since(start2))
}
