package main

import (
	"fmt"
	"sync" // <-- Подключаем пакет синхронизации
	"time"
)

// Обрати внимание: мы принимаем *sync.WaitGroup (УКАЗАТЕЛЬ)
// Если убрать звездочку, функция скопирует блокнот себе, и main никогда не узнает о завершении.
func boilKettle(wg *sync.WaitGroup) {
	// defer гарантирует, что Done() сработает при выводе из функции
	defer wg.Done()

	fmt.Println(" 🔥 Чайник: Начинаю кипятить...")
	time.Sleep(2 * time.Second)
	fmt.Println(" 🔥 Чайник: Вскипел!")
}

func cutVegetables(wg *sync.WaitGroup) {
	defer wg.Done()

	fmt.Println(" 🔪 Овощи: Начинаю резать...")
	time.Sleep(1 * time.Second)
	fmt.Println(" 🔪 Овощи: Готовы!")
}

func fryMeat(wg *sync.WaitGroup) {
	defer wg.Done()

	fmt.Println(" 🥩 Мясо: Жарится...")
	time.Sleep(3 * time.Second)
	fmt.Println(" 🥩 Мясо: Сочное и готовое!")
}

func main() {
	fmt.Println("=== КУХНЯ PRO v2.0 (WAITGROUP) ===")
	start := time.Now()

	// 1. Создаем "Блокнот Прораба"
	var wg sync.WaitGroup

	// 2. Назначаем задачи
	// У нас будет 3 дела, поэтому добавляем сразу 3
	// (Или можно делать wg.Add(1) перед каждым запуском)
	wg.Add(3)

	// 3. Запускаем горутины
	// ВАЖНО: Передаем адрес блокнота (&wg), а не копию!
	go boilKettle(&wg)
	go cutVegetables(&wg)
	go fryMeat(&wg)

	fmt.Println(" 👨‍🍳 Шеф: Все задачи розданы, жду...")

	// 4. БЛОКИРОВКА
	// Программа встанет на этой строке и будет ждать,
	// пока счетчик в wg не станет 0.
	wg.Wait()

	fmt.Println(" 👨‍🍳 Шеф: Всё готово! Ресторан закрывается.")
	fmt.Printf("Время работы: %s\n", time.Since(start))
}
