package main

import (
	"fmt"
	"math/rand"
	"sync"
	"time"
)

// 1. СТРУКТУРЫ ДАННЫХ
// Заказ (сырая задача)
type Order struct {
	ID        int
	PizzaName string
}

// Пицца (готовый результат)
type Pizza struct {
	OrderID   int
	PizzaName string
	isCooked  bool
	ChefID    int // Кто приготовил
}

// 2. РАБОТНИК (ВОРКЕР)
// Он крутится вечно, пока есть работа в канале jobs
func chef(id int, jobs <-chan Order, results chan<- Pizza, wg *sync.WaitGroup) {
	// Как только канал jobs закроют и работа кончится,
	// сработает defer и повар уйдет домой.
	defer wg.Done()

	fmt.Printf("👨‍🍳 Повар #%d: Вышел на смену!\n", id)

	// Читаем задачи из канала (rande работает, пока канал открыт)
	for order := range jobs {
		fmt.Printf("👨‍🍳 Повар #%d: Взял заказ #%d (%s)\n", id, order.ID, order.PizzaName)

		// Имитация работы (от 1 до 3 секунд)
		processingTime := time.Duration(rand.Intn(3)+1) * time.Second
		time.Sleep(processingTime)

		// Готовим результат
		cookedPizza := Pizza{
			OrderID:   order.ID,
			PizzaName: order.PizzaName,
			isCooked:  true,
			ChefID:    id,
		}

		// Отправляем готовую пиццу на выдачу
		results <- cookedPizza
	}

	fmt.Printf("👋 Повар #%d: Смена окончена, ухожу.\n", id)
}

func main() {
	fmt.Println("=== PIZZA FACTORY V1.0 (WORKER POOL) ===")

	// Настройки
	const numJobs = 100   // Сколько заказов
	const numWorkers = 10 // Сколько поваров

	// 1. Каналы
	// jobs - очередь заказов
	// results - готовая еда
	jobs := make(chan Order, numJobs)
	results := make(chan Pizza, numJobs)

	// 2. WaitGroup (чтобы знать, когда повара закончат)
	var wg sync.WaitGroup

	// 3. ЗАПУСКАЕМ ПОВАРОВ (Воркеров)
	for w := 1; w <= numWorkers; w++ {
		wg.Add(1) // +1 повар
		go chef(w, jobs, results, &wg)
	}

	// 4. КЛИЕНТ ДЕЛАЕТ ЗАКАЗЫ
	// Кидаем задачи в канал jobs
	menu := []string{"Пепперони", "Маргарита", "4 Сыра", "Гавайская", "Мясная"}

	for j := 1; j <= numJobs; j++ {
		order := Order{
			ID:        j,
			PizzaName: menu[rand.Intn(len(menu))],
		}
		jobs <- order // Отправляем в трубу
		fmt.Println("📥 Заказ принят:", order.PizzaName)
	}

	// ВАЖНО: Закрываем канал задач.
	// Это сигнал поварам: "Заказов больше не будет, доделывайте текущие и уходите".
	close(jobs)

	// 5. ЖДЕМ ЗАВЕРШЕНИЯ (в отдельной горутине)
	// Почему в отдельной? Чтобы мы могли параллельно читать результаты ниже.
	// Если ждать здесь (wg.Wait()), то мы заблокируем чтение results, и канал заполнится.
	go func() {
		wg.Wait()      // Ждем, пока все повара закончат
		close(results) // Закрываем канал выдачи, так как пиццы больше не будет
		fmt.Println("🛑 КУХНЯ ЗАКРЫТА: Все повара ушли.")

	}()

	// 6. ЗАБИРАЕМ ГОТОВЫЕ ЗАКАЗЫ (Main работает как Курьер)
	// Читаем из results, пока канал не закроется
	fmt.Println("\n🚀 КУРЬЕР: Начинаю развор...")

	for pizza := range results {
		fmt.Printf("✅ Доставлено: Заказ: #%d (%s) -> Приготовил Повар #%d\n",
			pizza.OrderID, pizza.PizzaName, pizza.ChefID)
	}

	fmt.Println("🏁 Смена завершена. Все заказы выполнены.")
}
